grevaillot/svd_tools/headers/STM32F427/dma2d.h
#pragma once 

/* --- DMA2D: DMA2D ------------------------------------------------- */

/** @defgroup dma2d_registers DMA2D Register
@{*/

/** DMA2D_DMA2D_CR DMA2D control register **/
#define DMA2D_DMA2D_CR			MMIO32(DMA2D_BASE + 0x00)
/** DMA2D_DMA2D_ISR DMA2D Interrupt Status Register **/
#define DMA2D_DMA2D_ISR			MMIO32(DMA2D_BASE + 0x04)
/** DMA2D_DMA2D_IFCR DMA2D interrupt flag clear register **/
#define DMA2D_DMA2D_IFCR			MMIO32(DMA2D_BASE + 0x08)
/** DMA2D_DMA2D_FGMAR DMA2D foreground memory address register **/
#define DMA2D_DMA2D_FGMAR			MMIO32(DMA2D_BASE + 0x0c)
/** DMA2D_DMA2D_FGOR DMA2D foreground offset register **/
#define DMA2D_DMA2D_FGOR			MMIO32(DMA2D_BASE + 0x10)
/** DMA2D_DMA2D_BGMAR DMA2D background memory address register **/
#define DMA2D_DMA2D_BGMAR			MMIO32(DMA2D_BASE + 0x14)
/** DMA2D_DMA2D_BGOR DMA2D background offset register **/
#define DMA2D_DMA2D_BGOR			MMIO32(DMA2D_BASE + 0x18)
/** DMA2D_DMA2D_FGPFCCR DMA2D foreground PFC control register **/
#define DMA2D_DMA2D_FGPFCCR			MMIO32(DMA2D_BASE + 0x1c)
/** DMA2D_DMA2D_FGCOLR DMA2D foreground color register **/
#define DMA2D_DMA2D_FGCOLR			MMIO32(DMA2D_BASE + 0x20)
/** DMA2D_DMA2D_BGPFCCR DMA2D background PFC control register **/
#define DMA2D_DMA2D_BGPFCCR			MMIO32(DMA2D_BASE + 0x24)
/** DMA2D_DMA2D_BGCOLR DMA2D background color register **/
#define DMA2D_DMA2D_BGCOLR			MMIO32(DMA2D_BASE + 0x28)
/** DMA2D_DMA2D_FGCMAR DMA2D foreground CLUT memory address register **/
#define DMA2D_DMA2D_FGCMAR			MMIO32(DMA2D_BASE + 0x2c)
/** DMA2D_DMA2D_BGCMAR DMA2D background CLUT memory address register **/
#define DMA2D_DMA2D_BGCMAR			MMIO32(DMA2D_BASE + 0x30)
/** DMA2D_DMA2D_OPFCCR DMA2D output PFC control register **/
#define DMA2D_DMA2D_OPFCCR			MMIO32(DMA2D_BASE + 0x34)
/** DMA2D_DMA2D_OCOLR DMA2D output color register **/
#define DMA2D_DMA2D_OCOLR			MMIO32(DMA2D_BASE + 0x38)
/** DMA2D_DMA2D_OMAR DMA2D output memory address register **/
#define DMA2D_DMA2D_OMAR			MMIO32(DMA2D_BASE + 0x3c)
/** DMA2D_DMA2D_OOR DMA2D output offset register **/
#define DMA2D_DMA2D_OOR			MMIO32(DMA2D_BASE + 0x40)
/** DMA2D_DMA2D_NLR DMA2D number of line register **/
#define DMA2D_DMA2D_NLR			MMIO32(DMA2D_BASE + 0x44)
/** DMA2D_DMA2D_LWR DMA2D line watermark register **/
#define DMA2D_DMA2D_LWR			MMIO32(DMA2D_BASE + 0x48)
/** DMA2D_DMA2D_AMTCR DMA2D AXI master timer configuration register **/
#define DMA2D_DMA2D_AMTCR			MMIO32(DMA2D_BASE + 0x4c)

/**@}*/


/** @defgroup dma2d_dma2d_cr DMA2DCR DMA2D control register
@{*/


#define DMA2D_DMA2D_CR_MODE_SHIFT		16
#define DMA2D_DMA2D_CR_MODE_MASK		0x03
/** @defgroup dma2d_dma2d_cr_mode MODE DMA2D mode This bit is set and cleared by software. It cannot be modified while a transfer is ongoing.
@{*/
/**@}*/

/** DMA2D_DMA2D_CR_CEIE Configuration Error Interrupt Enable This bit is set and cleared by software. **/
#define DMA2D_DMA2D_CR_CEIE		(1 << 13)
/** DMA2D_DMA2D_CR_CTCIE CLUT transfer complete interrupt enable This bit is set and cleared by software. **/
#define DMA2D_DMA2D_CR_CTCIE		(1 << 12)
/** DMA2D_DMA2D_CR_CAEIE CLUT access error interrupt enable This bit is set and cleared by software. **/
#define DMA2D_DMA2D_CR_CAEIE		(1 << 11)
/** DMA2D_DMA2D_CR_TWIE Transfer watermark interrupt enable This bit is set and cleared by software. **/
#define DMA2D_DMA2D_CR_TWIE		(1 << 10)
/** DMA2D_DMA2D_CR_TCIE Transfer complete interrupt enable This bit is set and cleared by software. **/
#define DMA2D_DMA2D_CR_TCIE		(1 << 9)
/** DMA2D_DMA2D_CR_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define DMA2D_DMA2D_CR_TEIE		(1 << 8)
/** DMA2D_DMA2D_CR_ABORT Abort This bit can be used to abort the current transfer. This bit is set by software and is automatically reset by hardware when the START bit is reset. **/
#define DMA2D_DMA2D_CR_ABORT		(1 << 2)
/** DMA2D_DMA2D_CR_SUSP Suspend This bit can be used to suspend the current transfer. This bit is set and reset by software. It is automatically reset by hardware when the START bit is reset. **/
#define DMA2D_DMA2D_CR_SUSP		(1 << 1)
/** DMA2D_DMA2D_CR_START Start This bit can be used to launch the DMA2D according to the parameters loaded in the various configuration registers. This bit is automatically reset by the following events: ** At the end of the transfer ** When the data transfer is aborted by the user application by setting the ABORT bit in DMA2D_CR ** When a data transfer error occurs ** When the data transfer has not started due to a configuration error or another transfer operation already ongoing (automatic CLUT loading). **/
#define DMA2D_DMA2D_CR_START		(1 << 0)

/**@}*/

/** @defgroup dma2d_dma2d_isr DMA2DISR DMA2D Interrupt Status Register
@{*/

/** DMA2D_DMA2D_ISR_CEIF Configuration error interrupt flag This bit is set when the START bit of DMA2D_CR, DMA2DFGPFCCR or DMA2D_BGPFCCR is set and a wrong configuration has been programmed. **/
#define DMA2D_DMA2D_ISR_CEIF		(1 << 5)
/** DMA2D_DMA2D_ISR_CTCIF CLUT transfer complete interrupt flag This bit is set when the CLUT copy from a system memory area to the internal DMA2D memory is complete. **/
#define DMA2D_DMA2D_ISR_CTCIF		(1 << 4)
/** DMA2D_DMA2D_ISR_CAEIF CLUT access error interrupt flag This bit is set when the CPU accesses the CLUT while the CLUT is being automatically copied from a system memory to the internal DMA2D. **/
#define DMA2D_DMA2D_ISR_CAEIF		(1 << 3)
/** DMA2D_DMA2D_ISR_TWIF Transfer watermark interrupt flag This bit is set when the last pixel of the watermarked line has been transferred. **/
#define DMA2D_DMA2D_ISR_TWIF		(1 << 2)
/** DMA2D_DMA2D_ISR_TCIF Transfer complete interrupt flag This bit is set when a DMA2D transfer operation is complete (data transfer only). **/
#define DMA2D_DMA2D_ISR_TCIF		(1 << 1)
/** DMA2D_DMA2D_ISR_TEIF Transfer error interrupt flag This bit is set when an error occurs during a DMA transfer (data transfer or automatic CLUT loading). **/
#define DMA2D_DMA2D_ISR_TEIF		(1 << 0)

/**@}*/

/** @defgroup dma2d_dma2d_ifcr DMA2DIFCR DMA2D interrupt flag clear register
@{*/

/** DMA2D_DMA2D_IFCR_CCEIF Clear configuration error interrupt flag Programming this bit to 1 clears the CEIF flag in the DMA2D_ISR register **/
#define DMA2D_DMA2D_IFCR_CCEIF		(1 << 5)
/** DMA2D_DMA2D_IFCR_CCTCIF Clear CLUT transfer complete interrupt flag Programming this bit to 1 clears the CTCIF flag in the DMA2D_ISR register **/
#define DMA2D_DMA2D_IFCR_CCTCIF		(1 << 4)
/** DMA2D_DMA2D_IFCR_CAECIF Clear CLUT access error interrupt flag Programming this bit to 1 clears the CAEIF flag in the DMA2D_ISR register **/
#define DMA2D_DMA2D_IFCR_CAECIF		(1 << 3)
/** DMA2D_DMA2D_IFCR_CTWIF Clear transfer watermark interrupt flag Programming this bit to 1 clears the TWIF flag in the DMA2D_ISR register **/
#define DMA2D_DMA2D_IFCR_CTWIF		(1 << 2)
/** DMA2D_DMA2D_IFCR_CTCIF Clear transfer complete interrupt flag Programming this bit to 1 clears the TCIF flag in the DMA2D_ISR register **/
#define DMA2D_DMA2D_IFCR_CTCIF		(1 << 1)
/** DMA2D_DMA2D_IFCR_CTEIF Clear Transfer error interrupt flag Programming this bit to 1 clears the TEIF flag in the DMA2D_ISR register **/
#define DMA2D_DMA2D_IFCR_CTEIF		(1 << 0)

/**@}*/

/** @defgroup dma2d_dma2d_fgmar DMA2DFGMAR DMA2D foreground memory address register
@{*/


