grevaillot/svd_tools/headers/STM32F427/dma2d.h
#define DMA2D_DMA2D_FGMAR_MA_SHIFT		0
#define DMA2D_DMA2D_FGMAR_MA_MASK		0xffffffff
/** @defgroup dma2d_dma2d_fgmar_ma MA Memory address Address of the data used for the foreground image. This register can only be written when data transfers are disabled. Once the data transfer has started, this register is read-only. The address alignment must match the image format selected e.g. a 32-bit per pixel format must be 32-bit aligned, a 16-bit per pixel format must be 16-bit aligned and a 4-bit per pixel format must be 8-bit aligned.
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_fgor DMA2DFGOR DMA2D foreground offset register
@{*/


#define DMA2D_DMA2D_FGOR_LO_SHIFT		0
#define DMA2D_DMA2D_FGOR_LO_MASK		0x3fff
/** @defgroup dma2d_dma2d_fgor_lo LO Line offset Line offset used for the foreground expressed in pixel. This value is used to generate the address. It is added at the end of each line to determine the starting address of the next line. These bits can only be written when data transfers are disabled. Once a data transfer has started, they become read-only. If the image format is 4-bit per pixel, the line offset must be even.
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_bgmar DMA2DBGMAR DMA2D background memory address register
@{*/


#define DMA2D_DMA2D_BGMAR_MA_SHIFT		0
#define DMA2D_DMA2D_BGMAR_MA_MASK		0xffffffff
/** @defgroup dma2d_dma2d_bgmar_ma MA Memory address Address of the data used for the background image. This register can only be written when data transfers are disabled. Once a data transfer has started, this register is read-only. The address alignment must match the image format selected e.g. a 32-bit per pixel format must be 32-bit aligned, a 16-bit per pixel format must be 16-bit aligned and a 4-bit per pixel format must be 8-bit aligned.
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_bgor DMA2DBGOR DMA2D background offset register
@{*/


#define DMA2D_DMA2D_BGOR_LO_SHIFT		0
#define DMA2D_DMA2D_BGOR_LO_MASK		0x3fff
/** @defgroup dma2d_dma2d_bgor_lo LO Line offset Line offset used for the background image (expressed in pixel). This value is used for the address generation. It is added at the end of each line to determine the starting address of the next line. These bits can only be written when data transfers are disabled. Once data transfer has started, they become read-only. If the image format is 4-bit per pixel, the line offset must be even.
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_fgpfccr DMA2DFGPFCCR DMA2D foreground PFC control register
@{*/


#define DMA2D_DMA2D_FGPFCCR_ALPHA_SHIFT		24
#define DMA2D_DMA2D_FGPFCCR_ALPHA_MASK		0xff
/** @defgroup dma2d_dma2d_fgpfccr_alpha ALPHA Alpha value These bits define a fixed alpha channel value which can replace the original alpha value or be multiplied by the original alpha value according to the alpha mode selected through the AM[1:0] bits. These bits can only be written when data transfers are disabled. Once a transfer has started, they become read-only.
@{*/
/**@}*/

/** DMA2D_DMA2D_FGPFCCR_RBS Red Blue Swap This bit allows to swap the R &amp; B to support BGR or ABGR color formats. Once the transfer has started, this bit is read-only. **/
#define DMA2D_DMA2D_FGPFCCR_RBS		(1 << 21)
/** DMA2D_DMA2D_FGPFCCR_AI Alpha Inverted This bit inverts the alpha value. Once the transfer has started, this bit is read-only. **/
#define DMA2D_DMA2D_FGPFCCR_AI		(1 << 20)

#define DMA2D_DMA2D_FGPFCCR_CSS_SHIFT		18
#define DMA2D_DMA2D_FGPFCCR_CSS_MASK		0x03
/** @defgroup dma2d_dma2d_fgpfccr_css CSS Chroma Sub-Sampling These bits define the chroma sub-sampling mode for YCbCr color mode. Once the transfer has started, these bits are read-only. others: meaningless
@{*/
/**@}*/


#define DMA2D_DMA2D_FGPFCCR_AM_SHIFT		16
#define DMA2D_DMA2D_FGPFCCR_AM_MASK		0x03
/** @defgroup dma2d_dma2d_fgpfccr_am AM Alpha mode These bits select the alpha channel value to be used for the foreground image. They can only be written data the transfer are disabled. Once the transfer has started, they become read-only. other configurations are meaningless
@{*/
/**@}*/


#define DMA2D_DMA2D_FGPFCCR_CS_SHIFT		8
#define DMA2D_DMA2D_FGPFCCR_CS_MASK		0xff
/** @defgroup dma2d_dma2d_fgpfccr_cs CS CLUT size These bits define the size of the CLUT used for the foreground image. Once the CLUT transfer has started, this field is read-only. The number of CLUT entries is equal to CS[7:0] + 1.
@{*/
/**@}*/

/** DMA2D_DMA2D_FGPFCCR_START Start This bit can be set to start the automatic loading of the CLUT. It is automatically reset: ** at the end of the transfer ** when the transfer is aborted by the user application by setting the ABORT bit in DMA2D_CR ** when a transfer error occurs ** when the transfer has not started due to a configuration error or another transfer operation already ongoing (data transfer or automatic background CLUT transfer). **/
#define DMA2D_DMA2D_FGPFCCR_START		(1 << 5)
/** DMA2D_DMA2D_FGPFCCR_CCM CLUT color mode This bit defines the color format of the CLUT. It can only be written when the transfer is disabled. Once the CLUT transfer has started, this bit is read-only. **/
#define DMA2D_DMA2D_FGPFCCR_CCM		(1 << 4)

#define DMA2D_DMA2D_FGPFCCR_CM_SHIFT		0
#define DMA2D_DMA2D_FGPFCCR_CM_MASK		0x0f
/** @defgroup dma2d_dma2d_fgpfccr_cm CM Color mode These bits defines the color format of the foreground image. They can only be written when data transfers are disabled. Once the transfer has started, they are read-only. others: meaningless
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_fgcolr DMA2DFGCOLR DMA2D foreground color register
@{*/


#define DMA2D_DMA2D_FGCOLR_RED_SHIFT		16
#define DMA2D_DMA2D_FGCOLR_RED_MASK		0xff
/** @defgroup dma2d_dma2d_fgcolr_red RED Red Value These bits defines the red value for the A4 or A8 mode of the foreground image. They can only be written when data transfers are disabled. Once the transfer has started, they are read-only.
@{*/
/**@}*/


#define DMA2D_DMA2D_FGCOLR_GREEN_SHIFT		8
#define DMA2D_DMA2D_FGCOLR_GREEN_MASK		0xff
/** @defgroup dma2d_dma2d_fgcolr_green GREEN Green Value These bits defines the green value for the A4 or A8 mode of the foreground image. They can only be written when data transfers are disabled. Once the transfer has started, They are read-only.
@{*/
/**@}*/


