grevaillot/svd_tools/headers/STM32F427/dma2d.h
#define DMA2D_DMA2D_FGCOLR_BLUE_SHIFT		0
#define DMA2D_DMA2D_FGCOLR_BLUE_MASK		0xff
/** @defgroup dma2d_dma2d_fgcolr_blue BLUE Blue Value These bits defines the blue value for the A4 or A8 mode of the foreground image. They can only be written when data transfers are disabled. Once the transfer has started, They are read-only.
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_bgpfccr DMA2DBGPFCCR DMA2D background PFC control register
@{*/


#define DMA2D_DMA2D_BGPFCCR_ALPHA_SHIFT		24
#define DMA2D_DMA2D_BGPFCCR_ALPHA_MASK		0xff
/** @defgroup dma2d_dma2d_bgpfccr_alpha ALPHA Alpha value These bits define a fixed alpha channel value which can replace the original alpha value or be multiplied with the original alpha value according to the alpha mode selected with bits AM[1: 0]. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only.
@{*/
/**@}*/

/** DMA2D_DMA2D_BGPFCCR_RBS Red Blue Swap This bit allows to swap the R &amp; B to support BGR or ABGR color formats. Once the transfer has started, this bit is read-only. **/
#define DMA2D_DMA2D_BGPFCCR_RBS		(1 << 21)
/** DMA2D_DMA2D_BGPFCCR_AI Alpha Inverted This bit inverts the alpha value. Once the transfer has started, this bit is read-only. **/
#define DMA2D_DMA2D_BGPFCCR_AI		(1 << 20)

#define DMA2D_DMA2D_BGPFCCR_AM_SHIFT		16
#define DMA2D_DMA2D_BGPFCCR_AM_MASK		0x03
/** @defgroup dma2d_dma2d_bgpfccr_am AM Alpha mode These bits define which alpha channel value to be used for the background image. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only. others: meaningless
@{*/
/**@}*/


#define DMA2D_DMA2D_BGPFCCR_CS_SHIFT		8
#define DMA2D_DMA2D_BGPFCCR_CS_MASK		0xff
/** @defgroup dma2d_dma2d_bgpfccr_cs CS CLUT size These bits define the size of the CLUT used for the BG. Once the CLUT transfer has started, this field is read-only. The number of CLUT entries is equal to CS[7:0] + 1.
@{*/
/**@}*/

/** DMA2D_DMA2D_BGPFCCR_START Start This bit is set to start the automatic loading of the CLUT. This bit is automatically reset: ** at the end of the transfer ** when the transfer is aborted by the user application by setting the ABORT bit in the DMA2D_CR ** when a transfer error occurs ** when the transfer has not started due to a configuration error or another transfer operation already on going (data transfer or automatic BackGround CLUT transfer). **/
#define DMA2D_DMA2D_BGPFCCR_START		(1 << 5)
/** DMA2D_DMA2D_BGPFCCR_CCM CLUT Color mode These bits define the color format of the CLUT. This register can only be written when the transfer is disabled. Once the CLUT transfer has started, this bit is read-only. **/
#define DMA2D_DMA2D_BGPFCCR_CCM		(1 << 4)

#define DMA2D_DMA2D_BGPFCCR_CM_SHIFT		0
#define DMA2D_DMA2D_BGPFCCR_CM_MASK		0x0f
/** @defgroup dma2d_dma2d_bgpfccr_cm CM Color mode These bits define the color format of the foreground image. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only. others: meaningless
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_bgcolr DMA2DBGCOLR DMA2D background color register
@{*/


#define DMA2D_DMA2D_BGCOLR_RED_SHIFT		16
#define DMA2D_DMA2D_BGCOLR_RED_MASK		0xff
/** @defgroup dma2d_dma2d_bgcolr_red RED Red Value These bits define the red value for the A4 or A8 mode of the background. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only.
@{*/
/**@}*/


#define DMA2D_DMA2D_BGCOLR_GREEN_SHIFT		8
#define DMA2D_DMA2D_BGCOLR_GREEN_MASK		0xff
/** @defgroup dma2d_dma2d_bgcolr_green GREEN Green Value These bits define the green value for the A4 or A8 mode of the background. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only.
@{*/
/**@}*/


#define DMA2D_DMA2D_BGCOLR_BLUE_SHIFT		0
#define DMA2D_DMA2D_BGCOLR_BLUE_MASK		0xff
/** @defgroup dma2d_dma2d_bgcolr_blue BLUE Blue Value These bits define the blue value for the A4 or A8 mode of the background. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only.
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_fgcmar DMA2DFGCMAR DMA2D foreground CLUT memory address register
@{*/


#define DMA2D_DMA2D_FGCMAR_MA_SHIFT		0
#define DMA2D_DMA2D_FGCMAR_MA_MASK		0xffffffff
/** @defgroup dma2d_dma2d_fgcmar_ma MA Memory Address Address of the data used for the CLUT address dedicated to the foreground image. This register can only be written when no transfer is ongoing. Once the CLUT transfer has started, this register is read-only. If the foreground CLUT format is 32-bit, the address must be 32-bit aligned.
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_bgcmar DMA2DBGCMAR DMA2D background CLUT memory address register
@{*/


#define DMA2D_DMA2D_BGCMAR_MA_SHIFT		0
#define DMA2D_DMA2D_BGCMAR_MA_MASK		0xffffffff
/** @defgroup dma2d_dma2d_bgcmar_ma MA Memory address Address of the data used for the CLUT address dedicated to the background image. This register can only be written when no transfer is on going. Once the CLUT transfer has started, this register is read-only. If the background CLUT format is 32-bit, the address must be 32-bit aligned.
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_opfccr DMA2DOPFCCR DMA2D output PFC control register
@{*/

/** DMA2D_DMA2D_OPFCCR_RBS Red Blue Swap This bit allows to swap the R &amp; B to support BGR or ABGR color formats. Once the transfer has started, this bit is read-only. **/
#define DMA2D_DMA2D_OPFCCR_RBS		(1 << 21)
/** DMA2D_DMA2D_OPFCCR_AI Alpha Inverted This bit inverts the alpha value. Once the transfer has started, this bit is read-only. **/
#define DMA2D_DMA2D_OPFCCR_AI		(1 << 20)

#define DMA2D_DMA2D_OPFCCR_CM_SHIFT		0
#define DMA2D_DMA2D_OPFCCR_CM_MASK		0x07
/** @defgroup dma2d_dma2d_opfccr_cm CM Color mode These bits define the color format of the output image. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only. others: meaningless
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_ocolr DMA2DOCOLR DMA2D output color register
@{*/


#define DMA2D_DMA2D_OCOLR_ALPHA_SHIFT		24
#define DMA2D_DMA2D_OCOLR_ALPHA_MASK		0xff
/** @defgroup dma2d_dma2d_ocolr_alpha ALPHA Alpha Channel Value These bits define the alpha channel of the output color. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only.
@{*/
/**@}*/


#define DMA2D_DMA2D_OCOLR_RED_SHIFT		16
#define DMA2D_DMA2D_OCOLR_RED_MASK		0xff
/** @defgroup dma2d_dma2d_ocolr_red RED Red Value These bits define the red value of the output image. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only.
@{*/
/**@}*/


#define DMA2D_DMA2D_OCOLR_GREEN_SHIFT		8
#define DMA2D_DMA2D_OCOLR_GREEN_MASK		0xff
/** @defgroup dma2d_dma2d_ocolr_green GREEN Green Value These bits define the green value of the output image. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only.
@{*/
/**@}*/


