grevaillot/svd_tools/headers/STM32F427/dma2d.h
#define DMA2D_DMA2D_OCOLR_BLUE_SHIFT		0
#define DMA2D_DMA2D_OCOLR_BLUE_MASK		0xff
/** @defgroup dma2d_dma2d_ocolr_blue BLUE Blue Value These bits define the blue value of the output image. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only.
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_omar DMA2DOMAR DMA2D output memory address register
@{*/


#define DMA2D_DMA2D_OMAR_MA_SHIFT		0
#define DMA2D_DMA2D_OMAR_MA_MASK		0xffffffff
/** @defgroup dma2d_dma2d_omar_ma MA Memory Address Address of the data used for the output FIFO. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only. The address alignment must match the image format selected e.g. a 32-bit per pixel format must be 32-bit aligned and a 16-bit per pixel format must be 16-bit aligned.
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_oor DMA2DOOR DMA2D output offset register
@{*/


#define DMA2D_DMA2D_OOR_LO_SHIFT		0
#define DMA2D_DMA2D_OOR_LO_MASK		0x3fff
/** @defgroup dma2d_dma2d_oor_lo LO Line Offset Line offset used for the output (expressed in pixels). This value is used for the address generation. It is added at the end of each line to determine the starting address of the next line. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only.
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_nlr DMA2DNLR DMA2D number of line register
@{*/


#define DMA2D_DMA2D_NLR_PL_SHIFT		16
#define DMA2D_DMA2D_NLR_PL_MASK		0x3fff
/** @defgroup dma2d_dma2d_nlr_pl PL Pixel per lines Number of pixels per lines of the area to be transferred. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only. If any of the input image format is 4-bit per pixel, pixel per lines must be even.
@{*/
/**@}*/


#define DMA2D_DMA2D_NLR_NL_SHIFT		0
#define DMA2D_DMA2D_NLR_NL_MASK		0xffff
/** @defgroup dma2d_dma2d_nlr_nl NL Number of lines Number of lines of the area to be transferred. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only.
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_lwr DMA2DLWR DMA2D line watermark register
@{*/


#define DMA2D_DMA2D_LWR_LW_SHIFT		0
#define DMA2D_DMA2D_LWR_LW_MASK		0xffff
/** @defgroup dma2d_dma2d_lwr_lw LW Line watermark These bits allow to configure the line watermark for interrupt generation. An interrupt is raised when the last pixel of the watermarked line has been transferred. These bits can only be written when data transfers are disabled. Once the transfer has started, they are read-only.
@{*/
/**@}*/


/**@}*/

/** @defgroup dma2d_dma2d_amtcr DMA2DAMTCR DMA2D AXI master timer configuration register
@{*/


#define DMA2D_DMA2D_AMTCR_DT_SHIFT		8
#define DMA2D_DMA2D_AMTCR_DT_MASK		0xff
/** @defgroup dma2d_dma2d_amtcr_dt DT Dead Time Dead time value in the AXI clock cycle inserted between two consecutive accesses on the AXI master port. These bits represent the minimum guaranteed number of cycles between two consecutive AXI accesses.
@{*/
/**@}*/

/** DMA2D_DMA2D_AMTCR_EN Enable Enables the dead time functionality. **/
#define DMA2D_DMA2D_AMTCR_EN		(1 << 0)

/**@}*/
